modm-ext/data.modm.io/docs/svd/header_stm32h755xx_cm7.svd
    <peripheral derivedFrom="GPIOA">
      <name>GPIOD</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x58020c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOE</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x58021000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOF</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x58021400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOG</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x58021800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOH</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x58021c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOI</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x58022000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOJ</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x58022400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOK</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x58022800</baseAddress>
    </peripheral>
    <peripheral>
      <name>RCC</name>
      <description>Reset and Clock Control</description>
      <baseAddress>0x58024400</baseAddress>
      <interrupt>
        <name>RCC</name>
        <description>RCC global Interrupt</description>
        <value>5</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>RCC clock control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSION</name>
              <description>Internal High Speed clock enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIKERON</name>
              <description>Internal High Speed clock enable for some IPs Kernel</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIRDY</name>
              <description>Internal High Speed clock ready flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIDIV</name>
              <description>Internal High Speed clock divider selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSIDIVF</name>
              <description>HSI Divider flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSION</name>
              <description>The Internal RC 4MHz oscillator clock enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSIRDY</name>
              <description>The Internal RC 4MHz oscillator clock ready</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSIKERON</name>
              <description>Internal RC 4MHz oscillator clock enable for some IPs Kernel</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSI48ON</name>
              <description>HSI48 clock enable clock enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSI48RDY</name>
              <description>HSI48 clock ready</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>D1CKRDY</name>
              <description>D1 domain clocks ready flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>D2CKRDY</name>
              <description>D2 domain clocks ready flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSEON</name>
              <description>External High Speed clock enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSERDY</name>
              <description>External High Speed clock ready</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSEBYP</name>
              <description>External High Speed clock Bypass</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSSHSEON</name>
              <description>HSE Clock security System enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1ON</name>
              <description>System PLL1 clock enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1RDY</name>
              <description>System PLL1 clock ready</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2ON</name>
              <description>System PLL2 clock enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2RDY</name>
              <description>System PLL2 clock ready</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3ON</name>
              <description>System PLL3 clock enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3RDY</name>
              <description>System PLL3 clock ready</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HSICFGR</name>
          <description>HSI Clock Calibration Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSICAL</name>
              <description>HSICAL[11:0] bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>HSITRIM</name>
              <description>HSITRIM[6:0] bits</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRRCR</name>
          <description>Clock Recovery RC Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSI48CAL</name>
              <description>HSI48CAL[9:0] bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSICFGR</name>
          <description>CSI Clock Calibration Register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CSICAL</name>
              <description>CSICAL[7:0] bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CSITRIM</name>
              <description>CSITRIM[5:0] bits</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <description>RCC clock configuration register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SW</name>
              <description>SW[2:0] bits (System clock Switch)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWS</name>
              <description>SWS[2:0] bits (System Clock Switch Status)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI used as system clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <description>CSI used as system clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>HSE used as system clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1</name>
                  <description>PLL1 used as system clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPWUCK</name>
              <description>Wake Up from stop and CSS backup clock selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPKERWUCK</name>
              <description>Kernel Clock Selection after a Wake Up from STOP</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCPRE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOCLOCK</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_2</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_3</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_4</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_5</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_6</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_7</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_8</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_9</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_10</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_11</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_12</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_13</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_14</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_15</name>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_16</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_17</name>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_18</name>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_19</name>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_20</name>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_21</name>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_22</name>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_23</name>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_24</name>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_25</name>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_26</name>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_27</name>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_28</name>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_29</name>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_30</name>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_31</name>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_32</name>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_33</name>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_34</name>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_35</name>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_36</name>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_37</name>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_38</name>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_39</name>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_40</name>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_41</name>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_42</name>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_43</name>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_44</name>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_45</name>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_46</name>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_47</name>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_48</name>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_49</name>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_50</name>
                  <value>50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_51</name>
                  <value>51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_52</name>
                  <value>52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_53</name>
                  <value>53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_54</name>
                  <value>54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_55</name>
                  <value>55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_56</name>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_57</name>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_58</name>
                  <value>58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_59</name>
                  <value>59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_60</name>
                  <value>60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_61</name>
                  <value>61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_62</name>
                  <value>62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_63</name>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRTIMSEL</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIM</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMPRE</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWICE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR_TIMES</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCO1PRE</name>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MCO1</name>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MCO2PRE</name>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MCO2</name>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
